{
  "job description": "About the job\r\nWe’re seeking a Software Developer to join us in our mission to improve human health and quality of life through the development, distribution, and application of advanced computational methods!\r\n\r\nSchrödinger is on the cutting edge of computer-aided drug discovery and materials science. We set the record for the largest and fastest cloud computing run, and our software suites continue to revolutionize the design of therapeutics and materials.\r\n\r\nAs a member of our simulation scheduling and orchestration team, you’d play a key role in enabling scientific calculations that run at scale.\r\n\r\nWho Will Love This Job\r\n\r\nAn accomplished Go developer who has at least some Python experience\r\nA great engineer with a good understanding of distributed systems and concurrency\r\nA thoughtful developer with a test-first approach\r\nAn experienced Linux user, preferably with at least some knowledge of Windows and/or macOS\r\nA craftsperson who loves honing their skills in programming tools of choice, from VSCode to GitHub CoPilot\r\nA capable debugger and performance optimizer\r\nA lifelong learner who considers new approaches\r\nAn excellent written and verbal communicator\r\n\r\nWhat You’ll Do\r\n\r\nExtend our cross-platform Go-based job distribution system that enables scientific calculations at scale with a team of other engineers\r\nProvide infrastructure to facilitate computational drug discovery and materials design\r\n\r\nWhat You Should Have\r\n\r\nA Computer Science degree and a firm grasp of data structures and algorithms\r\nA genuine interest in science (no prior knowledge necessary, however)\r\n\r\nPay And Perks\r\n\r\nSchrödinger understands it’s people that make a company great. Because of this, we’re prepared to offer a competitive salary, equity-based compensation, and a wide range of benefits that include healthcare (with dental and vision), a 401k, pre-tax commuter benefits, a flexible work schedule, and a parental leave program. We have catered meals in the office, a company culture that is relaxed but engaged, and over a month of paid vacation time. Our Administrative and Human Resources departments also plan a myriad of fun company-wide events. New York is home to our largest office, but we have teams all over the world. Schrödinger is honored to have been included in Crain's New York Best Places to Work, BuiltIn's NYC Best Place to Work, and Newsweek's list of America's 100 Most Loved Workplaces.\r\n\r\nEstimated base salary range (NYC only): $120,000 - $180,000. Actual compensation package is dependent on a number of factors, including, for example, experience, education, degrees held, market data, and business needs. If you have any questions regarding the compensation for this role, do not hesitate to reach out to a member of our Strategic Growth team.\r\n\r\nSound exciting? Apply today and join us!\r\n\r\nAs an equal opportunity employer, Schrödinger hires outstanding individuals into every position in the company. People who work with us have a high degree of engagement, a commitment to working effectively in teams, and a passion for the company's mission. We place the highest value on creating a safe environment where our employees can grow and contribute, and refuse to discriminate on the basis of race, color, religious belief, sex, age, disability, national origin, alienage or citizenship status, marital status, partnership status, caregiver status, sexual and reproductive health decisions, gender identity or expression, sexual orientation, or any other protected characteristic. To us, \"diversity\" isn't just a buzzword, but an important element of our core principles and key business practices. We believe that diverse companies innovate better and think more creatively than homogenous ones because they take into account a wide range of viewpoints. For us, greater diversity doesn't mean better headlines or public images - it means increased adaptability and profitability."
}